Tekla Open API Reference for Tekla Structures 2025
DotPrintScalingType Enumeration
 The print scaling type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintScalingType
Public Enumeration DotPrintScalingType
Members
Member name | Value | Description
Auto | 0 |  Auto scale.
Scale | 1 |  Use defined scale.
See Also
Reference
Tekla.Structures.Drawing Namespace